tap "coursier/formulas"
tap "derailed/k9s"
tap "gastownhall/gascity"
tap "grishka/grishka"
tap "homebrew/bundle"

brew "act"
brew "astro"
brew "beads"
brew "coreutils"
brew "d2"
brew "delta"
brew "dolt"
brew "flock"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "helm"
brew "jq"
brew "just"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "mas"
brew "nmap"
brew "nvm"
brew "prek"
brew "pyenv"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "gastownhall/gascity/gascity"

cask "ankerwork"
cask "arduino"
cask "claudebar"
cask "codex"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "flux-app"
cask "gcloud-cli"
cask "ghostty"
cask "handy"
cask "istat-menus"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "lens"
cask "microsoft-openjdk"
cask "microsoft-openjdk@17"
cask "multimc"
cask "grishka/grishka/neardrop"
cask "phantomjs"
cask "postman"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tunnelblick"
cask "zoom"

vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "foam.foam-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "terrastruct.d2"
vscode "yzhang.markdown-all-in-one"

go "cmd/go"
go "cmd/gofmt"

uv "tox", with: ["tox-uv"]
