tap "coursier/formulas"
tap "gastownhall/gascity"
tap "homebrew/bundle"

brew "act"
brew "astro"
brew "beads"
brew "circleci"
brew "coreutils"
brew "d2"
brew "delta"
brew "dive"
brew "dolt"
brew "flock"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "jfrog-cli"
brew "k9s"
brew "kind"
brew "kubectx"
brew "lazygit"
brew "mas"
brew "mise"
brew "mysql"
brew "nmap"
brew "pkgconf"
brew "poppler"
brew "postgresql@14"
brew "prek"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "xidel"
brew "yq"
brew "zoxide"
brew "zsh"
brew "coursier/formulas/coursier"
brew "gastownhall/gascity/gascity"

cask "aws-vpn-client"
cask "claudebar"
cask "dbeaver-community"
cask "docker-desktop"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "handy"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom"

vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "foam.foam-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "terrastruct.d2"
vscode "yzhang.markdown-all-in-one"

go "cmd/go"
go "cmd/gofmt"

npm "corepack"
npm "pnpm"

uv "tox", with: ["tox-uv"]
