cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'mas'

brew 'coreutils'
brew 'tree'

# Development
cask 'atom'
cask 'datagrip'
brew 'git'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'jetbrains-toolbox'
brew 'macvim'  # yadr zsh wants me to use macvim instead of vim
cask 'postman'
cask 'pycharm'
brew 'pyenv'
cask 'sublime-text'
brew 'telnet'
brew 'terraform'
brew 'terragrunt'

# Spacemacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'

# Apps
cask 'alred'
mas 'Amphetamine', id: 937984704
cask 'bartender'
cask 'evernote'
cask 'google-backup-and-sync'  # non-corp
# cask 'google-drive-file-stream'  # corp
cask 'istat-menus'
cask 'karabiner-elements'
cask 'spectacle'  # Window Management
cask 'tunnelblick'

# GUI Apps
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'

