# .Brewfile for linuxbrew

tap 'homebrew/cask', 'git@github.com:homebrew/homebrew-cask'
tap 'homebrew/bundle'

# CLI
brew 'docker'
brew 'docker-compose'
brew 'gcc'
brew 'git'
brew 'jq'
brew 'kind'
brew 'kubernetes-cli'
brew 'minikube'
brew 'pyenv'
brew 'tree'
brew 'vim'

# Development
cask 'atom'
cask 'jetbrains-toolbox'
cask 'postman'
#cask 'sublime-text'

# GUI Apps
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'zoomus'

