# .Brewfile for linuxbrew

tap 'caskroom/cask'
tap 'homebrew/bundle'

# CLI
brew 'gcc'
brew 'git'
brew 'jq'
brew 'pyenv'
brew 'tree'
brew 'telnet'
brew 'vim'

# Development
cask 'atom'
cask 'jetbrains-toolbox'
cask 'postman'
#cask 'sublime-text'

# GUI Apps
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'zoomus'

