cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

# If some previously purchased software from the Mac App Store needs
# to be included, we can use mas to ease the installs.
# brew 'mas'

brew 'coreutils'
brew 'gcc'
brew 'tree'

# Development
cask 'arduino'
# cask 'atom'
brew 'd2'  # alternative to mermaid (diagram)
cask 'dbeaver-community'
brew 'dive'  # analyze docker images
cask 'docker'  # brew docker is the cli; cask docker is docker-desktop
brew 'gh'  # github-cli
brew 'git'
brew 'helm'
brew 'helmenv'
# cask 'iterm2'
# cask 'jetbrains-toolbox'
brew 'jq'
brew 'derailed/k9s/k9s'
brew 'kind'
brew 'kubernetes-cli'
brew 'kubectx'
cask 'lens'
# brew 'macvim'  # yadr zsh wants me to use macvim instead of vim
brew 'nmap'
cask 'postman'
brew 'pyenv'
cask 'raspberry-pi-imager'
cask 'sublime-text'
brew 'telnet'
brew 'terraform'
brew 'terragrunt'
brew 'tree'
brew 'vim'
cask 'visual-studio-code'
brew 'yq'

# Spacemacs
# tap 'd12frosted/emacs-plus'
# brew 'emacs-plus'

# Apps
# cask 'alred'
mas 'Amphetamine', id: 937984704
# cask 'bartender'
# cask 'dropbox'
cssk 'flux'
# cask 'google-backup-and-sync'  # non-corp
# cask 'google-drive-file-stream'  # corp
cask 'itsycal'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'rectangle'  # Window Management
cask 'tunnelblick'

# GUI Apps
cask 'ankerwork'
cask 'arc'  # internet browser
# cask 'boostnote'
cask 'discord'
# cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'multimc'
cask 'obsidian'
cask 'slack'
cask 'spotify'
cask 'zoom'
